# config.py

# تنظیمات اتصال به صرافی (به عنوان مثال بایننس را انتخاب کردیم)
# فعلا برای تست نیازی به API Key نداریم، چون فقط می‌خواهیم داده‌ها را بخوانیم.
EXCHANGE_ID = 'binance'
API_KEY = ''
API_SECRET = ''

# تنظیمات استراتژی SMC
SYMBOL = 'BTC/USDT'           # جفت ارزی که می‌خواهیم معامله کنیم
TIMEFRAME_H4 = '4h'           # تایم فریم ساختار اصلی (4 ساعته)
TIMEFRAME_M15 = '15m'         # تایم فریم نقطه ورود (15 دقیقه)
LIMIT = 100                   # تعداد کندل‌هایی که در هر درخواست دریافت می‌کنیم